import React from 'react'
import styles from './Info.module.scss'
import styles2 from '../components/RichText/RichText.module.scss'
import Title from '../components/UI/Title/Title'
import RichText from '../components/RichText/RichText'
import Footer from '../components/UI/Footer/Footer'

const PublicOffer = () => {
    return (
        <>
            <section className={styles.info_page}>
                <div className={[styles.inner, 'container'].join(' ')}>
                    <Title className={styles.title}>Публичная оферта о заключении</Title>
                    <RichText>
                        <p className={styles2.title}>Публичная оферта о заключении</p>
                        <p className={styles2.title}>ЛИЦЕНЗИОННОГО ДОГОВОРА</p>
                        <p>о предоставлении права пользования результатами интеллектуальной деятельности на условиях неисключительный лицензии</p>
                        <p>г. Томск, редакция от 19 декабря 2022 года</p>
                        <p>Настоящая Публичная оферта (далее - Оферта) представляет собой публичное предложение, исходящее от Индивидуального предпринимателя Заяц Сергея Николаевича ИНН 422316692531 (почтовый адрес: 634033, Россия обл. Томская г. Томск, пер. Ботанический дом 6/4 кв. 63), именуемого в дальнейшем Лицензиар заключить лицензионный договор о предоставлении права пользования результатами интеллектуальной деятельности, поименованными в Приложении № 1 к настоящей Оферте, на условиях неисключительный лицензии (далее – Договор) с использованием функционала веб-сайта https://last-stay.ru на приведённых ниже условиях. Оферта определяет все существенные условия предлагаемого к заключению Договора. Любое дееспособное лицо, которое своими конклюдентными и иными действиями, предусмотренными законом и настоящей Офертой, приняло (акцептовало) настоящую Оферту о заключении Договора именуется в дальнейшем “Лицензиат”. Лицензиар имеет право в любой момент изменять настоящий Договор и все приложения к нему (полностью или в части) в одностороннем порядке, без предварительного согласования с Лицензиатом. Все изменения вступают в силу в дату размещения, если более длительный срок вступления изменений в силу не определен дополнительно при публикации новой редакции Договора, и не требуют подписания Сторонами. В связи с вышеизложенным, внимательно прочитайте текст данного Договора и, если Вы не согласны с каким-либо пунктом Договора, Лицензиар предлагает Вам отказаться от каких—либо действий необходимых для акцепта.  Договор, заключенный посредством акцепта настоящей оферты, регламентируется нормами законодательства о договоре присоединения, поскольку его условия определены Лицензиаром в настоящей оферте и могут быть приняты любым лицом не иначе как путем присоединения к предложенному Договору в целом. Договор действителен в электронном виде и не требует двустороннего подписания.</p>
                        <p className={styles2.title}>1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ.</p>
                        <p>«Оферта» – настоящий документ, предложение, содержащее все существенные условия Договора, из которого усматривается воля Лицензиара заключить лицензионный договор о предоставлении права пользования результатами интеллектуальной деятельности, поименованными в Приложении № 1 к настоящей Оферте, на условиях неисключительный лицензии, с каждым, кто откликнется. «Акцепт оферты» – ответ любого дееспособного лица на оферту Лицензиара путем ее принятия, порождающий правоотношения между Лицензиаром и Лицензиатом, являющийся моментом заключения Договора между Сторонами. Акцепт Оферты должен быть полным и безоговорочным. Полным и безоговорочным Акцептом настоящей публичной Оферты являются конклюдентные действия Лицензиата по использованию функционала веб-сайта https://last-stay.ru.  “Результаты интеллектуальной деятельности, РИД” – объекты, описание которых содержится в соответствующем разделе веб-сайта https://last-stay.ru. «Лицензиат», «Клиент» – физическое дееспособное лицо, действующее от себя лично, акцептовавшее настоящую оферту и использующее соответствующий функционал РИД. Лицензиат является Стороной настоящего Договора. “Законодательство” - система нормативно правовых актов и иных источников права Российской Федерации. “Сайт, Веб-Сайт” - https://last-stay.ru.</p>
                        <p className={styles2.title}>2. ПРЕДМЕТ ДОГОВОРА</p>
                        <ul>
                            <li>2.1. По настоящему договору Лицензиат обязуется принять и оплатить, а Лицензиар обязуется предоставить Лицензиату право пользования результатами интеллектуальной деятельности Лицензиара, поименованных Сторонами в тексте Приложения № 1 к настоящему Договору (РИД), на условиях неисключительной (простой) лицензии.</li>
                            <li>2.2. Взаимодействие Сторон осуществляется согласно механике, описанной на Сайте.</li>
                        </ul>
                        <p className={styles2.title}>3. РАСЧЁТЫ СТОРОН</p>
                        <ul>
                            <li>3.1. Базовый функционал результатов интеллектуальной деятельности Лицензиара, поименованных Сторонами в тексте Приложения № 1 к настоящему Договору (РИД), право пользования которыми передаётся Лиценизату, доступен без взимания платы.</li>
                            <li>3.2. Оплате Лицензиатом в пользу Лицензиара подлежит предоставление права использования Лицензиатом дополнительного функционала РИД, заключающегося в пополнении виртуального (игрового) счёта Лицензиата запрошенным Лицензиатом количеством donate-рублей (донат-рублей), исходя из курса: 1 donate-рубль = 1 рубль РФ. Игровая механика РИД позволяет Лицензиату впоследствии производить обмен с другими пользователями РИД (иными лицензиатами) имеющихся у него donate-рублей на иные игровые ценности по своему усмотрению.</li>
                            <li>3.3. Стоимость предоставления права пользования дополнительным функционалом РИД по настоящему Договору выражена в рублях РФ (иной валюте), исходя из курса: 1 donate-рубль = 1 рубль РФ. </li>
                            <li>3.4. Лицензиат оплачивает услуги Лицензиара путём перечисления безналичных денежных средств по реквизитам Лицензиара, указанным на Сайте или иным удобным ему способом из числа указанных на Сайте, в сроки и на условиях, указанных в соответствующем разделе Сайта.</li>
                        </ul>
                        <p className={styles2.title}>4. ПРАВА И ОБЯЗАННОСТИ СТОРОН</p>
                        <ul>
                            <li>4.1. Права и обязанности Лицензиара:</li>
                            <li>4.1.1. Лицензиар обязан исполнить взятые на себя обязательства с надлежащим качеством и в срок. </li>
                            <li>4.1.2. Приостановить или расторгнуть Договор в одностороннем внесудебном порядке без платы за отказ от Договора на любой стадии его исполнения.</li>
                            <li>4.1.3. Потребовать прекращения использования результатов интеллектуальной деятельности Лицензиара (ограничить, запретить доступ) в случае наличия просрочки оплаты стоимости предоставления неисключительной лицензии.</li>
                            <li>4.1.4. Проводить профилактические работы на сервере, для чего временно приостанавливать доступ к сайту.</li>
                        </ul>
                        <ul>
                            <li>4.2. Права и обязанности Лицензиата:</li>
                            <li>4.2.1. Признавать документы и сообщения, подписанные с использованием простой и неквалифицированной электронной подписью, в том числе поставленной на скан-копии документа, а также путём акцепта представленной оферты, равнозначными документам, подписанным собственноручной подписью на бумажном носителе. </li>
                            <li>4.2.2. Лицензиат обязан принять и оплатить исполнение обязательств Лицензиаром в сроки, размере и порядке, предусмотренными настоящим Договором и приложениями к нему.</li>
                            <li>4.2.3. Соблюдать правила использования Сайта.</li>
                            <li>4.2.4. Совершать (воздержать от совершения) иные фактические и юридические действия, обязательность совершения которых (обязанность воздержаться от совершения которых) следует из правил пользования Сайтом, размещенным в его составе.</li>
                        </ul>
                        <p className={styles2.title}>5. ОТВЕТСТВЕННОСТЬ СТОРОН, КОНФИДЕНЦИАЛЬНОСТЬ И ОСОБЫЕ УСЛОВИЯ</p>
                        <ul>
                            <li>5.1. Любая из Сторон настоящего Договора, не исполнившая обязательства по Договору или исполнившая их ненадлежащим образом, несет за это ответственность в соответствии с действующим законодательством.</li>
                            <li>5.2. В случае нарушения Лицензиатом сроков оплаты юридических и фактических действий Лицензиара в рамках настоящего Договора, Лицензиат обязан выплатить Исполнителю пеню в размере 1 % от причитающейся к выплате суммы за каждый день просрочки платежа, от суммы задолженности.</li>
                            <li>5.3. Настоящий Договор может быть заключен посредством электронной связи (электронная почта и иные каналы связи) путём подписания скан-копий документа в порядке, предусмотренном ст. 434 Гражданского Кодекса Российской Федерации, с обязательным последующим предоставлением оригинала документа. До предоставления Стороной оригинала документа действует его электронная копия. Идентификация документа, отправленного по электронным каналам связи производится путём проверки наличия сведений о дате, времени и адреса отправки договора, соглашения (иного документа) и присутствием всех или некоторых контактных данных сторон, указанных в соответствующем разделе настоящего соглашения, в электронном сообщении и наименовании адресата, направившего такое сообщение, содержащее электронную версию документа.</li>
                            <li>5.4. Лицензиар не отвечает за неблагоприятные последствия обмена чем-либо между Лицензиатом и иным лицом (иным лицензиатом), совершенным в рамках игровой механики РИД.</li>
                        </ul>
                        <p className={styles2.title}>6. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ</p>
                        <ul>
                            <li>6.1. Стороны освобождаются от ответственности за частичное или полное неисполнение обязательств по настоящему Договору, если это неисполнение явилось следствием обстоятельств непреодолимой силы, то есть чрезвычайных и непредотвратимых при данных условиях обстоятельств, возникших после заключения настоящего Договора. К обстоятельствам непреодолимой силы относятся события, на которые не могут оказывать влияние действия Сторон и за возникновение которых Стороны ответственности не несут, а именно: наводнения, пожары, землетрясения или другие стихийные бедствия, принятие государственными органами актов, препятствующих выполнению обеими Сторонами обязательств по данному Договору, транспортные катастрофы, забастовки, военные действия, блокады и другие обстоятельства, которые могут влиять на выполнение обязательств по настоящему Договору, в месте исполнения договора.</li>
                            <li>6.2. При наступлении обстоятельств, указанных п.6.1, каждая Сторона должна без промедления известить о них в письменном виде другую Сторону. Извещение должно содержать данные о характере обстоятельств, а также официальные документы, удостоверяющие наличие этих обстоятельств и дающие оценку их влияния на возможность исполнения стороной своих обязательств по данному Договору.</li>
                            <li>6.3. Срок выполнения обязательств по настоящему договору отодвигается соразмерно времени, в течение которого действуют обстоятельства непреодолимой силы и их последствия.</li>
                            <li>6.4. В связи с возникшими обстоятельствами непреодолимой силы Стороны должны подписать протокол о прекращении действия настоящего Договора либо согласовать совместные действия по преодолению неблагоприятных последствий указанных обстоятельств.</li>
                            <li>6.5. Сторона, которая не исполнила своей обязанности известить о наступлении обстоятельств непреодолимой силы, теряет свое право ссылаться на них.</li>
                        </ul>
                        <p className={styles2.title}>7. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</p>
                        <p>7.1.	Споры и разногласия, возникшие в процессе исполнения настоящего Договора, по вопросам, непредусмотренным условиями настоящего договора, Стороны разрешают путем переговоров, руководствуясь действующим законодательством Российской Федерации. При невозможности урегулирования споров путем переговоров, споры подлежат разрешению в Арбитражном суде по месту нахождения Лицензиара. Для обращения в суд обязательно предъявление письменной претензии, которая рассматривается другой стороной в течение 14 (четырнадцати) рабочих дней со дня получения, но не более 30 (тридцати) календарных дней с момента её направления.</p>
                        <p>8. ПОЛИТИКА ВОЗВРАТА ДЕНЕЖНЫХ СРЕДСТВ</p>
                        <ul>
                            <li>8.1. Оплаченное Лицензиатом право использования дополнительного функционала Сайта считается предоставленным в полном объёме с момента отображения в соответствующем разделе Сайта определенного Лицензиатом количества Donate-рублей и возможности воспользоваться ими в рамках игровой механики. В таком случае возврат денежных средств не производится.</li>
                            <li>8.2. Единственным основанием для возврата Лицензиату оплаченных им денежных средств является невозможность воспользоваться Donate-рублями в рамках игровой механики в течение 7 (семи) дней с момента получения Лицензиаром денежных средств от Лицензиата.</li>
                        </ul>
                        <p>РЕКВИЗИТЫ ЛИЦЕНЗИАРА</p>
                        <p>Индивидуальный Предприниматель Заяц Сергей Николаевич</p>
                        <p>Юридический адрес: 634033 Россия обл Томская г Томск пер Ботанический дом 6/4 кв 63 ИНН: 422316692531</p>
                        <p>БИК: 044525411</p>
                        <p>Банк: ФИЛИАЛ "ЦЕНТРАЛЬНЫЙ" БАНКА ВТБ (ПАО)</p>
                        <p>Корреспондентский счёт: 30101810145250000411</p>
                        <p>Рассчётный счёт: 40802810113420000305</p>

                        <p>Приложение № 1 к Публичной оферте о заключении лицензионного договора о предоставлении права пользования результатами интеллектуальной деятельности на условиях неисключительный лицензии</p>
                        <p>Предоставление права пользования результатами интеллектуальной деятельности Лицензиара на условиях неисключительной лицензии</p>
                        <ul>
                            <li>1.1.	Во исполнение обязательств, изложенных в п. 1.1 Договора, Лицензиар предоставляет Лицензиату право использования результатом интеллектуальной деятельности Лицензиара – web-сайтом https://last-stay.ru (далее – Сайт), с сохранением за Лицензиаром права выдачи лицензий другим лицам, то есть, на условиях простой (неисключительной) лицензии. Сайт предоставляется «как есть», что означает, что он может быть не лишен недостатков, неточностей, недоработок, о чем уведомлен Лицензиат до заключения настоящего Договора.</li>
                            <li>1.2.	Стоимость предоставления права пользования дополнительным функционалом Сайтом указана в соответствующем разделе Сайта. Лицензиар имеет право ограничить (запретить) доступ Лицензиата к Сайту в целом или отдельным его функциям в любой момент по своему усмотрению.</li>
                            <li>1.3.	Лицензиат самостоятельно обеспечивает антивирусную защиту на рабочем месте.</li>
                            <li>1.4.	Лицензиат самостоятельно и под свою ответственность обеспечивает соблюдение мер безопасности по обеспечению защиты конфиденциальной информации на рабочем месте. </li>
                            <li>1.5.	Лицензиат не имеет права на копирование Сайта, тиражирование Сайта или его частей, использование Сайта или его частей в целях, отличных от целей, оговоренных выше.</li>
                            <li>1.6.	Лицензиат не имеет права на проведение дизассемблирования, декомпиляции, «обратного проектирования» (или любым другим способом получать доступ к закрытому исходному коду) Сайта или его частей.</li>
                            <li>1.7.	Лицензиат не имеет права на передачу (продажу, сдачу в аренду, в безвозмездное пользование, путем предоставления доступа и пр.) Сайта или его частей третьим лицам.</li>
                            <li>1.8.	Лицензиат не имеет права на эксплуатацию Сайта или его части не в соответствии с документацией на него.</li>
                            <li>1.9.	Лицензиат не имеет права на использование Сайта или его части в качестве основы для разработки нового программного обеспечения.</li>
                        </ul>
                        <p>РЕКВИЗИТЫ ЛИЦЕНЗИАРА</p>
                        <p>Индивидуальный Предприниматель Заяц Сергей Николаевич</p>
                        <p>Юридический адрес: 634033 Россия обл Томская г Томск пер Ботанический дом 6/4 кв 63 ИНН: 422316692531</p>
                        <p>БИК: 044525411</p>
                        <p>Банк: ФИЛИАЛ "ЦЕНТРАЛЬНЫЙ" БАНКА ВТБ (ПАО)</p>
                        <p>Корреспондентский счёт: 30101810145250000411</p>
                        <p>Рассчётный счёт: 40802810113420000305 </p>
                    </RichText>
                </div>
            </section>
            <Footer className={styles.footer}></Footer>
        </>
    )
}

export default PublicOffer